{
  "image":              "http://www.iphon.fr/public/Snooz/2017/Q2/linelight-jeu-iphone-ipad-casse-tete-lumiere-calme-3.jpg",
  "date":               "",
  "author":             "",
  "title":              "Incremental Learnings in Onboarding",
  "title_secondary":    "How to communicate How-to to users without using texts",
  "content":            "<p>In the award-winning puzzle game, linelight, users encounter a single light on a line leading to a circular light on one side, without clear guidance to users. With limited options available for users, they try basic inputs via. Keyboards or mouse and they figure out that the line moves along the line using arrow keys. There are only 2 directions to go there; one gets stuck and the other to the circular light. Reaching the circular light would open up the next stage, where the user also learns the goal of the game. This is the basis of the game.</p> <p>The users are introduced with more complex routes and obstacles incrementally. The balance between complexity and clarity is one of the biggest challenge in a game design and the playing yourself and testing with users are only way to nail that down.</p><div class='img-container'><img src='https://linelightgame.com/screens/screen_v0.4.2_01.jpg' /><img src='https://linelightgame.com/screens/screen_v0.4.2_02.jpg' /><div class='caption'>More complex rules and obstacles are introduced incrementally.</div></div><p>Monument Valley also does guide users beautifully. In Monument Valley 2, this learning process also gets married with its core story; the growth of a child and her departure from her mother. Even its suggestion to play with sounds (suggesting to use headphones to respect others around) is integrated elegantly in loading sequence.</p><div class='img-container'><img src='images/monument-valley-2-incremental-learning.PNG'/><img src='images/monument-valley-2-incremental-learning.gif'/><div class='caption'>Monument Valley 2: Incremental learning prior to encountering the game title.</div></div><div class='img-container'><img src='images/monument-valley-2-audio.PNG' /><div class='caption'>Monument Valley 2: The experience of audio is elegantly integrated in the loading screen.</div></div>"
}