{
  "image":              "https://spotify.i.lithium.com/t5/image/serverpage/image-id/25127i56C1A9A55214A500?v=1.0",
  "date":               "",
  "author":             "",
  "title":              "Spotify UX research",
  "title_secondary":    "",
  "content":            "<h2>1. Spotify creates a playlist both from your history and a from specific song</h2><p>Spotify is about discovering new songs based on its recommendation engine that is articulated by user search and compilation and its own recommendation engine.</p><p><span class='caption'>* More than 40 million listeners have used Discover Weekly by May 2016, since its launch on July 2015. (Source by Spotify’s release)</span></p><p>In this context, there are two main user cases:</p><p>The first user explores curated playlists such as Discover Weekly or Daily Mix, and the second user heads to the specific artist and explores popular songs by the artist. Taking either path, Spotify leads users to discover a new song. <b>The new song can be added or used to create new a playlist based on the song.</b> This introduces users to a new cycle of discovery. <b>With each interaction, this endless cycle makes for a better personalization experience.</b></p><p><b>Small gimmicks such as a press-hold-to-preview makes the endless chaining of playlists flow frictionlessly.</b> With this, users can preview and observe new playlists or songs without disrupting their current listening experience.</p><div class='img-container'><img src='../img/spotify-9.png' /></div><p><h2>2. Spotify eliminated the need to own and organize your own music</h2></p><p>Because of the infinite feedback loop mentioned above, users are able to enjoy music without bothering to organizing music. This had been a burden for many people when music digitized and when they started to own tens of thousands of songs. This is why people like using Spotify at work. Spotify successfully achieved what iPod Shuffle ('Life is random') tried to do in 2005.</p><h2 class='improve'>I’D IMPROVE</h2><h2>3. Enjoy part of songs </h2><p>Soundcloud successfully visualizes the moment where other listeners are excited in the song. Because Spotify is also about discovering new songs, visualizing these moments would help users not to miss songs’ most loved moments and to give a new song a chance.</p><p>I also suggest a feature where you can share your favorite moment of a song with a friend.  In this way, the recipient also has a better chance of loving the song.</p><div class='img-container'><img src='../img/spotify-11-soundcloud-reference.png'/><div class='caption'>SoundCloud : Example for users’ reactions are visible in each moment of a song.</div></div><div class='img-container'><img src='../img/spotify-10.png' /></div><h2>4. Allow disliking of songs to make users feel their reactions are strongly affecting Spotify’s recommendations.</h2><p>There is an inconsistency in the interaction options to songs depending if a song is from Daily Mix, Radio Station, or Others. <span class='caption'>(Table below)</span></p><p>As users feel that they have more control over personalization, it encourages them to interact more. Disliking is an example feature that is clear and should be accessible from every case, especially for listeners new to Spotify who don’t have enough search history or songs saved to lists to aggregate suggestions.</p><div class='img-container'><img src='../img/spotify-13.png' /></div>"
}