{
  "image":              "http://www.airbnbsecrets.com/wp-content/uploads/2016/09/airbnb_app.jpg",
  "date":               "",
  "author":             "",
  "title":              "Airbnb UX research",
  "title_secondary":    "",
  "content":            "<h2>1. How the Airbnb site evolved with its expanded business scope</h2><p>Airbnb is expanding its business from a straightforward home-sharing service to an extensive travel experience provider. As a result the site has to bridge more varied content.  Airbnb has adopted well while maintaining its straightforward call to action on its home page.</p><p>Aiirbnb has focused on “Travel to Home” and “Making Friends.”  It has been expressed in its simple but smart copy <b><i>“Welcome Home”</i></b> from the older version of the site to the more recent  <b><i>“Book unique homes and experience a city like a local.”</i></b> Then with the only stand out CTA, being a location and date picker, the Airbnb  home page has communicated what the core business proposition is in minimal way.</p><p>As Airbnb has evolved to provide extensive travel experiences, the hero image/video was removed. A single strong visual was powerful to market its service in the beginning, but as the name got more mature, it is more effective without it. This way, it draws more attention the to list of available experiences in a grid underneath. <b>A Series of images that they provide speak their vision more effectively than a single hero image.</b> Once the user engages with this list, the main copy collapses and the CTA is minimized- the list becomes the main focus.   It is a subtle move but this change describes how Airbnb expanded its business scope, while it maintained its simple interface that many users are familiar with.</p><div class='img-container'><img src='../img/airbnb-10.png' /><div class='caption'>Before 2016 Redesign.</div></div><div class='img-container'><img src='../img/airbnb-11.png' /><div class='caption'>After 2016 Redesign : When the main copy and the main cta are key visual elements.</div></div><div class='img-container'><img src='../img/airbnb-12.jpg' /><div class='caption'>After 2016 Redesign : When user scrolls down to engage with the list of experiences.</div></div><h2>2. Collaborative Planning</h2><p>Users can share their wishlist with anyone.  This function is a strength of Airbnb because much of travel is with friends, partners or families.  Its thumbs-up/down function is powerful since usually one traveler of the group tends to be more enthusiastic about finding accommodations.  Copying the wishlist concept popular in online shopping was a smart move and even more applicable in this context as travel is even more collaborative than online shopping.</p><div class='img-container'><img src='../img/airbnb-13.png' /><div class='caption'>Shared wishlist example. Thumbs up/down function is strong.</div></div><h2>3. Gamifying Hosting Experiences</h2><p>Airbnb has been able to grow a strong community of hosts by gamifying the hosting experience.  Achievable goals for hosts are visible to keep their accounts active and to achieve Superhost status.</p><div class='img-container'><img src='../img/airbnb-14.jpg' /><div class='caption'>Simplicity of metrics and the fact that most of those metrics are easily achievable are keys to excite hosts.  The panel on the right gives a great urge for hosts to keep up their good status.</div></div><h2>4. Reconnect Reminders</h2><p>Airbnb reminds hosts and guests to send seasonal notes to each other. I think it is a nice way to reminds users that Airbnb’s value is also about meeting people at destinations.</p><h2 class='improve'>I’D IMPROVE</h2><h2>5. For You- Personalization</h2><p>The heart of the travel experience is location.</p><p>The current website shows listings of experiences with or without selecting a location. “For you” is great copy for this personalization, however seeing this option without a user inputting anything personal seems to make the experience weaker and inauthentic.</p><div class='img-container'><img src='../img/airbnb-15.png' /><div class='caption'>Although personalization may be based on users personal history, the list of experiences seem less curated or personalized without any necessity of user input- it’s self-generating.</div></div><p><b>My suggestion is to wait until a user has some input interaction with the content before showing any personalization.</b> My proposal is to tweak the front layout and let users get excited by picking a city first. Then the list of experiences will be more narrowed down and easier to digest.</p><div class='img-container'><img src='../img/Airbnb-2.jpg' /><div class='caption'>Suggestion: A new home page which leads users to discover an interesting destination first before promoting experiences.</div></div>"
}