{
  "image":              "https://www.technobuffalo.com/wp-content/uploads/2017/09/yahoo-finance-welcome-1280x693.png",
  "date":               "",
  "author":             "",
  "title":              "Yahoo Finance UX Research",
  "title_secondary":    "",
  "content":            "<p>Yahoo Finance is known for the simple interface and the destination app for basic stock app. Its unique users, which exceeds 70 million unique users per month, set distance to its competitors such as MSN Money, CNN Money, and Google Finance.</p><p><a href='http://www.telegraph.co.uk/technology/0/replacements-for-apples-default-apps-that-will-supercharge-your/yahoo-finance/''>”14 alternatives to Apple's default apps that will supercharge your iPhone</a>- To replace Stocks” by Telegraph.</p><p>Yahoo Finance went through its major design overhaul in July 2016. New design focuses on connecting stories and data with continuous news feed, inspired by social media news feeds.</p><h2>1. Home : Major markets over personal watchlist </h2><p>The major markets with key color background above users’ personal watchlist makes its hierarchy clear.</p><p>Managing multiple watchlist is subtle enough (only suggestive by small triangle next to the watchlist name) that it does not make it look complex for users who only have one watchlist.</p><div class='img-container'><img src='../img/yahoo-finance-1-major-markets.png' /><div class='caption'>Examples : Market overview and the personal portfolio (Left). News feed below data (Right)</div></div><p><h2>2. Social aspects </h2>Yahoo Finance takes an interesting approach to engage with users more by showing 30 thematic watchlists curated by the Yahoo Finance team or famous brokers such as the Berkshire Hathaway. It is educational and also it exposes more new stocks to users.</p><div class='img-container'><img src='../img/yahoo-finance-2-social-aspects.png' /><div class='caption'>Examples : Explore curated watchlists to follow (Left). View a watchlist that user follows (Right)</div></div><p>Yahoo Finance also lets users to comment on an individual stock to help new users to evaluate it. However, it only shows users’ comments and it does not visually indicate how other users evaluate this stock.</p><p><h2 class='improve'>I’D IMPROVE</h2></p><p>Stock Master makes evaluations on stocks clear with bar graph with one end “Bearish” and the other end “Bullish”.</p><div class='img-container'><img src='../img/yahoo-finance-3-comments.png'/><div class='caption'>Examples : Yahoo Finance only shows users’ comments (Left). Stock Master displays how users evaluate (Right)</div></div><p><h2>3. Contextual news feed</h2>News feed comprising the market movements is located below the market data. Inspired by the social network, the news feed is continuous and it’s relative to what market data is at the top- For example, if it’s a specific stock page, the news below is only about that stock.</p>In android app, individual news card is labeled with stock index with its current price, which helps to expose related or competitive stocks.</p><div class='img-container'><img src='../img/yahoo-finance-4-contextual-news.png'/><div class='caption'>Contextual news example. Stock prices related to stories are  listed with their symbols.</div></div><p><h2>4. Accessibility of news become problematics for users with a lot of stocks</h2></p><p>The contextual news feed from above may become problematic because this layout is dependent on how many stocks a user wants to add into a watchlist- If watchlist is long, the news becomes hard to access and the news becomes hard to digest. I listed 2 examples from other app which may solve this issue.</p><h2 class='improve'>I’D IMPROVE</h2><p>Market Watch app provides important news feed in in-app notification style within its watchlist page. In this method, stories appear more alerted and more filtered.</p><div class='img-container'><img src='../img/yahoo-finance-5-market-watch.png'/><div class='caption'>Example from Market Watch: Only important news are delivered in notification format.</div></div><p>CNBC app even analyzes markets and summarizes reasons behind market movements. The summary is short and concise and can be viewed per market, industry or commodity categories. The app can become a great destination for users to come to see brief overview of the markets.</p><h2>5. For You- Personalization</h2><p>Yahoo Finance integrated a couple of visual indications for users to determine their stock positions. I find EPS and analysts’ target prices are extremely useful. I would love to see EPS overlaid with price movements for easier understanding in relations and in longer duration to visualize seasonal impacts to prices.</p><h3>EPS (Earnings per stock)</h3><div class='img-container'><img src='../img/yahoo-finance-6-earnings.png' /><div class='caption'>Earnings Per Stock Visualization : Estimated and actual EPS are listed for last 4 quarters.</div></div><h3>Financial</h3><div class='img-container'><img src='../img/yahoo-finance-7-financials.png'/><div class='caption'>Financial Visualization : Revenue and earnings from past 3 years are accessible.</div></div><h3>Analyst Price Targets and Recommendation</h3><div class='img-container'><img src='../img/yahoo-finance-8-recommendations.png'/><div class='caption'>Analyst Price Target and Analysts’ Grading History (Left), Recommendations (Right)</div></div>"
}